cxy0036/jiadewei/资料/转发_ Nuvoton Standard ISP Code_N76E003.7z/N76E003_SampleCode_Keil_C51_V0.0/N76E003_SampleCode_Keil_C51_V0.0/Sample_Code/I2C_Master-Slave/I2C_Master/Code/I2C_M.c
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright(c) 2016 Nuvoton Technology Corp. All rights reserved.                                         */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/

//***********************************************************************************************************
//  Nuvoton Technoledge Corp. 
//  Website: http://www.nuvoton.com
//  E-Mail : MicroC-8bit@nuvoton.com
//  Date   : Apr/29/2016
//***********************************************************************************************************

//***********************************************************************************************************
//  File Function: N76E003 I2C master mode demo code, the Slave address = 0xA4
//
//   ____________            _____________ 
//  |            |   SDA    |             |
//  |            |<-------->|             |
//  |            |          |             |
//  |N76E003(M) |          | N76E003(S) |
//  |(I2C_Master)|          | (I2C_Slave) |
//  |            |   SCL    |             |
//  |            |--------->|             |
//  |____________|          |_____________|
//
//  The protocol of I2C is same the "24LC64"
//***********************************************************************************************************


#include <stdio.h>
#include <absacc.h>
#include "N76E003.h"
#include "Define.h"
#include "Common.h"
#include "Delay.h"
#include "SFR_Macro.h"
#include "Function_define.h"

#define I2C_CLOCK               19
#define EEPROM_SLA              0xe6
#define EEPROM_WR               0
#define EEPROM_RD               1
#define ERROR_CODE              0x78
#define PAGE_SIZE               3

//UINT8 BUFF[40];
extern	 unsigned char code g_abMaxxDSPCommands[];

//========================================================================================================
void Init_I2C(void)
{
//    /* Set I2C clock rate */
    I2CLK = I2C_CLOCK; 

    /* Enable I2C */
    set_I2CEN;                                   
}
//========================================================================================================
//void I2C_
//========================================================================================================
void I2C_Error(void)
{
//    P3 = I2STAT;
//    P3 = ERROR_CODE;
    while (1)P12 = 0;    
}
//========================================================================================================
void I2C_Process(UINT8 *u8DAT)
{
    UINT32 u32Count;

//--------------------------------------------------------------------------------------------
//----  Page Write----------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
    /* Step1 */
    set_STA;                                    /* Send Start bit to I2C EEPROM */
    clr_SI;
    while (!SI);                                //Check SI set or not
    if (I2STAT != 0x08)                         //Check status value after every step
        I2C_Error();
    
    /* Step2 */
    clr_STA;                                    //STA=0
    I2DAT = (EEPROM_SLA | EEPROM_WR);
    clr_SI;
    while (!SI);                                //Check SI set or not
    if (I2STAT != 0x18)              
        I2C_Error();

//    /* Step3 */
//    I2DAT = 0x00;                               //address high for I2C EEPROM
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x28)              
//        I2C_Error();
//                    
//    /* Step4 */
//    I2DAT = 0x00;                               //address low for I2C EEPROM
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x28)              
//        I2C_Error();

//		I2DAT = u8DAT;
//		clr_SI;
//		while (!SI);
//		if (I2STAT != 0x28) 
//				I2C_Error();
    /* Step5 */
    for (u32Count = 0; u32Count < PAGE_SIZE; u32Count++)
    {
        I2DAT = *u8DAT++;
        clr_SI;
        while (!SI);                            //Check SI set or not
        if (I2STAT != 0x28)              
            I2C_Error();

//        u8DAT = ~u8DAT;        
    }

//--------------------------------------------------------------------------------------------
//----  Waitting the ready for I2C write------------------------------------------------------
//--------------------------------------------------------------------------------------------
//    /* Step6 */
//    do{
//        set_STO;
//        clr_SI;
//        
//        set_STA;                                //Check if no ACK is returned by EEPROM, it is under timed-write cycle
//        clr_SI;
//        while (!SI);                            //Check SI set or not
//        if (I2STAT != 0x08)                     //Check status value after every step
//            I2C_Error();

//        clr_STA;
//        I2DAT = (EEPROM_SLA | EEPROM_WR);
//        clr_SI;
//        while (!SI);                            //Check SI set or not
//    }while (I2STAT != 0x18);
//    
//    /* Step7 */
//    set_STO;
//    clr_SI;
//    while (STO);                                /* Check STOP signal */
//--------------------------------------------------------------------------------------------
//----  Page Read ----------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
//    /* Step8 */
//    set_STA;
//    clr_SI;          
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x08)                         //Check status value after every step
//        I2C_Error();

//    /* Step9 */
//    I2DAT = (EEPROM_SLA | EEPROM_WR);
//    clr_STA;
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x18)              
//        I2C_Error();

//    /* Step10 */
//    I2DAT = 0x00;                               //address high for I2C EEPROM
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x28)              
//        I2C_Error();

//    /* Step11 */
//    I2DAT = 0x00;                               //address low for I2C EEPROM
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x28)              
//        I2C_Error();

//    /* Step12 */
//    /* Repeated START */
//    set_STA;                       
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x10)                         //Check status value after every step
//        I2C_Error();
//    
//    /* Step13 */
//    clr_STA;                                    //STA needs to be cleared after START codition is generated
//    I2DAT = (EEPROM_SLA | EEPROM_RD);
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x40)              
//        I2C_Error();
//    
    /* Step14 */
//    for (u32Count = 0; u32Count <PAGE_SIZE-1; u32Count++)
//    {
//        set_AA;
//        clr_SI;        
//        while (!SI);                            //Check SI set or not

//        if (I2STAT != 0x50)              
//            I2C_Error();
//        
////        if (I2DAT != u8DAT)             
////            I2C_Error();
////        u8DAT = ~u8DAT; 
//				BUFF[u32Count] = I2DAT;
//    } 
    
//    /* Step15 */
//    clr_AA;
//    clr_SI;
//    while (!SI);                                //Check SI set or not
//    if (I2STAT != 0x58)              
//        I2C_Error();

//    /* Step16 */
    set_STO;
    clr_SI;
    while (STO);                                /* Check STOP signal */ 
}
//========================================================================================================
void main(void)
{
    /* Note
       MCU power on system clock is HIRC (22.1184MHz), so Fsys = 22.1184MHz
    */
    UINT8 *p = g_abMaxxDSPCommands;
		UINT16	i=0,j=0;
    Set_All_GPIO_Quasi_Mode;	
		P13_OpenDrain_Mode;
		P14_OpenDrain_Mode;
		I2CPX = 0;
    Init_I2C();                                 //initial I2C circuit
		for(i=0;i<306;i++)	
		{
			I2C_Process(p);                          /* I2C Master will send 0x55,0xAA,.... to slave */
			p += 3; 
			//Timer2_Delay1ms(1);
			for(j=0;j<1500;j++);
		}
	
    //P0 = 0x00;
    //P3 = 0x00;
    
    while (1);
/* =================== */
}

